<?php
// Conexão com o banco de dados
require_once 'conexao.php';
require_once 'calc_horas.php';
require_once 'g_ver_login.php';
require_once 'ingaia.php';
$solicitante=$email;

//busca imóvel já agendado

if(!isset($_GET['PROGRESS'])){
    $PROGRESS=0;
}else{
    $PROGRESS=$_GET['PROGRESS']+0;
}

//busca imovel superlogica
//$lista_contratos=['0625-366','1184-001','1732-001','0044-001','0783-590','1329-006','0207-002','1329-005','1736-001','1589-001','0594-001','1735-001','0357-001','0338-007','0040-406','0594-001','1738-001','1577-003','1156-006','1295-001','0365-009','0982-001','1740-001','1126-001','1738-002','0588-007','1514-001','0608-505','0343-045','1737-001','0202-001','1739-001','0146-656','1648-001','0246-002','1741-001','0956-001','1744-001','1742-001','0760-516','0107-001','0855-004'];
//$lista_contratos=['1554-005','1734-001','1544-001','1565-001','1126-001','0913-002','0536-173','1295-001','0203-498','0881-002','0298-003','0851-001','1376-001','0948-001','0900-003','0704-347','0365-250','1026-001','0343-045','0317-002','0837-002','1248-002','1560-001','0667-267','0960-001','1542-001','1323-001','0375-002','0837-001','0203-033','0203-183','0045-050','1673-001','0967-009','0133-227','0136-632','0412-001','1328-002','1420-001','1341-001','0285-580','1025-003'];
//$lista_contratos=['0637-003','0203-034','0031-480','1031-002','0881-002','1762-001','0298-003','1763-001','0203-007','1761-001','0203-007','0407-714','0715-001','1764-001','0275-014','0910-003','1765-001','0031-480','0679-296','0122-005','0045-222','0910-006','0910-007','1329-008','1446-002','0859-002','0967-056','0967-055','0528-086','0047-289','0326-801','0846-001','0417-004','0454-415','1625-001','0204-004','0045-222','0341-001','0584-216','1666-001','1334-001','0275-014','1446-002','1209-001','0439-002','0004-001','0275-239','0417-004','0875-004','0679-296','1494-001','0325-821','1516-001','1387-001','1451-002','0326-801','1516-002','0067-002','0693-328','1587-001','0338-392','1377-001'];
//$lista_contratos=['0338-392','1426-001','1769-001','1497-001','1770-001','1771-001','1021-001','0837-001','0736-432','1771-002','1772-001','1666-001','1668-001','1021-004','1774-001','0203-038','1776-001','1426-001','0029-002','1577-004','0004-001','1495-002','0275-009','1653-002','0584-216','1767-001','0045-006','1766-001','0733-416','0183-571','0028-998','1334-001','0905-008','0767-531','1494-001','0275-239','1611-001','1451-002','1133-002','1773-001','1768-001','0339-001','0765-007','0548-115','0741-443','0558-129','0122-002','1306-001','0275-274','0203-020','1619-001','0486-028','0779-354','0733-416','1564-001','0511-067','0028-998','0203-038','0029-002','1514-002','0767-531','0471-005','1668-001','1060-001','0380-867','1654-001','1645-001','1506-001','0928-001','0275-160','1738-001','0063-001','0154-009','1159-010','0028-003','1471-001','1747-001','1636-001','1066-001','1682-001','0275-009','1365-001','0765-007','1387-001','1159-002','1178-002','1502-001','1217-001'];
/*$lista_contratos=['0067-002','1165-013','1639-001','1588-001','0471-005','1159-010','1775-001','0789-003','1376-001','1779-001',
                  '1484-001','1781-001','1781-002','1212-005','0893-001','1783-001','0154-009','0203-020','0602-001','1021-005',
                  '1212-006','1654-001','0779-354','1564-001','1645-001','1516-001','1778-001','0275-160','1780-001','1514-002',
                  '0203-028','1443-001','1759-002','1523-001','0047-010','1066-001','1608-001','1567-001','1777-001','1570-001',
                  '1785-001','1787-001','1143-001','0893-001','0167-001','0625-001','1652-004','0587-204','0950-004','1402-001',
                  '1418-001','1570-001','1567-001','1306-003','0203-028','1443-001','0602-001','1523-001','1021-002','1364-001',
                  '1728-001','0368-001','0913-001','0640-002','0667-267','1594-001','0876-001','1328-002','1583-001','0741-443',
                  '0585-002','0548-115','0028-998','1571-001','1658-001','1316-001','1786-001','1612-001','1165-015','0741-002',
                  '1539-001','1659-001','0104-784'];
*/

$lista_contratos=['1330-001','1506-001','0625-001','1418-001','1788-001','1652-004','1306-001','1054-004','1619-001','1571-001','1738-002','1791-001','1795-001','1402-001','1392-001','1550-002','0365-006','1784-001','1799-001','1165-013','1054-006','1364-001','1019-003','1393-001','0741-002','0423-001','1539-001','0516-072','1594-001','1790-001','0800-001','1587-001','1362-002','0890-001','1392-001','0338-449','1464-001','1652-001','0154-478','0275-251','1672-001','1413-001','0203-017','1417-001','0365-006','1156-006','0516-072','0154-479','0745-455','1401-002','0968-001','1687-001','0559-001','1127-001','1528-001','1258-001','0183-727','1695-001','1402-001','0741-443','1212-007','1658-001','0587-204','1794-001','1019-003','0275-274','0203-030','0275-011','1342-001','1037-002','1728-001','0052-006','0052-003','1781-003','0207-001','1379-006','1664-001','0338-449','1801-001','0173-674','1651-002','1792-001','1798-001','1797-001','0183-727','0317-002','1738-002','1105-002','1087-001','1533-001','0203-030','0154-495','0018-003','0812-001','1031-002','1019-003','1342-001','0052-006','1082-001','1664-001','1380-001','1457-001','0173-674','0423-001','1661-001','0018-253','0366-847','1421-001','0800-001','0967-001','1434-001','1566-001','0551-118','0827-001'];
// print_r($params);
        function superlogicaApi_pesquisa($action,$metodo='GET',$params=array(),$tokens=array()){
            switch ($metodo) {
                case 'POST':
                    $contentType = "Content-Type: application/x-www-form-urlencoded";
                    break;
                default:
                    $contentType = "";
                    break;
            }
            $ch = curl_init(); 
            $params = http_build_query($params); 
            //echo "https://apps.superlogica.net/imobiliaria/api/".$action.'?'.$params;
            curl_setopt($ch, CURLOPT_URL, "https://apps.superlogica.net/imobiliaria/api/".$action.'?'.$params); 
            curl_setopt($ch, CURLOPT_RETURNTRANSFER, TRUE); 
            curl_setopt($ch, CURLOPT_FOLLOWLOCATION, TRUE); 
            curl_setopt($ch, CURLOPT_SSL_VERIFYPEER, FALSE); 
            curl_setopt($ch, CURLOPT_SSL_VERIFYHOST, FALSE); 
            curl_setopt($ch, CURLOPT_CUSTOMREQUEST, $metodo); 
            curl_setopt($ch, CURLOPT_HTTPHEADER, array($contentType,
                                                        "app_token: ".$tokens['app_token'],
                                                        "access_token: ".$tokens['access_token'],
                                                        ));
            $response = curl_exec($ch);
            curl_close($ch);
            //echo $response;
            return json_decode($response,true);
        }

$contrato_cod=$lista_contratos[$PROGRESS];

        //PESQUISA IMOVEL
        $params['prioridade']='contratos';
        $params['pesquisa']=$contrato_cod.'/';
        $tela='buscaavancada';

        $oauth = array('access_token'=>'02ql6TNzgeIa','app_token'=>'LwfZRYvrOEwQ');
        $result = superlogicaApi_pesquisa($tela,'GET',$params,array('app_token'=>$oauth['app_token'],'access_token'=>$oauth['access_token']));
        
        if(sizeof($result['data'])>0){
            $vars['id']=$result['data'][(sizeof($result['data'])-1)]['id_contrato_con'];
            $dados=ingaia('contratos',$vars);
            $SUPERLOGICA['codigo']=$dados['data'][0]['codigo_contrato'];
            $contrato_id=$vars['id'];

            
            $ac=$dados['data'][0]['st_areatotal_imo'];
                $ac=str_replace('.','',$ac);
                $ac=str_replace(',','.',$ac);
                if($ac!=''){
                    $ac=(float) ($ac+0);
                    $area_construida=$ac;
                }else{
                    $area_construida=null;
                }
                
        }else{
            //codigo nao encontrado
            echo ('ERRO #1: CÓDIGO '.$contrato_cod.' INVÁLIDO');
        }
        if(strpos($SUPERLOGICA['codigo'], $params['pesquisa'])===false){
            //codigo diferente
            echo ('ERRO #2: CÓDIGO '.$contrato_cod.' INVÁLIDO');
        }

        //fium busca imovel superlogica

        // Verificar a conexão
        if ($conn->connect_error) {
            die("Falha na conexão com o banco de dados: " . $conn->connect_error);
        }

        // Preparar e executar a instrução SQL para inserir os dados no banco
        if($area_construida!=null and $area_construida!='' and $area_construida!=0){
            if($area_construida>=106){
                $tamanho_at=3;
            }else if($area_construida>=66){
                $tamanho_at=2;
            }else {
                $tamanho_at=1;
            }

            $sql = "UPDATE `agendamentos` SET  `imovel_area_construida` = '$area_construida', `imovel_tamanho_id`='$tamanho_at' where contrato_id = $contrato_id";
            echo $sql;
            if ($conn->query($sql) === TRUE) {
                //atualizado com sucesso             
            } else {
                echo "Erro ao salvar: " . $conn->error;
            }
        }

        $next=$PROGRESS+1;
        if(isset($lista_contratos[$next])){
            echo '<!DOCTYPE html>
                <html lang="pt-BR">
                <head>
                    <meta charset="UTF-8">
                    <meta name="viewport" content="width=device-width, initial-scale=1.0">
                    <meta http-equiv="refresh" content="0;url=cronograma_update_area_construida.php?PROGRESS='.$next.'">
                    <title>Iniciando Atualização '.$next.'</title>
                </head>
                </html>';
        }else{
            echo 'Atualização concluida';
        }
// Fechar a conexão com o banco de dados
$conn->close();
?>
